[
  {
    "title": "PVR Wins Consumer Case: Restriction on Outside Snacks Upheld, Free Water Mandated",
    "description": "<p>The District Consumer Disputes Redressal Commission, Ernakulam, dismissed a consumer complaint against PVR Cinemas regarding its policy of prohibiting outside food and beverages. The complainant argued that this restriction constituted an unfair trade practice, forcing consumers to purchase overpriced in-house items.</p>\n\n<p>The Commission ruled that cinema theaters have the legal right to regulate entry conditions, including restricting outside food, referencing the Supreme Court precedent set in K.C. Cinema v. State of J&K. This right is contingent upon ensuring free access to drinking water and accommodating special needs. The complainant failed to prove a deficiency in service, as the ban on outside food was consistent with established legal precedent.</p>\n\n<p>While dismissing the complaint, the Commission issued a binding directive, ordering PVR Cinemas to strictly comply with its undertaking to provide uninterrupted access to free RO-filtered drinking water for all customers. This includes maintaining the facility hygienically and displaying prominent signage. This decision balances the operational rights of the multiplex with the fundamental health and welfare of consumers, mitigating potential exploitative practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/pvr-wins-case-outside-food-ban-upheld-free-water-mandated.jpg"
  },
  {
    "title": "RBI Issues Directions on Settlement of Claims for Deceased Customers",
    "description": "<p>The Reserve Bank of India (RBI) released the Reserve Bank of India (Settlement of Claims in respect of Deceased Customers of Banks) Directions, 2025, effective March 31, 2026. These directions consolidate and standardize procedures for settling claims related to deposit accounts, safe deposit lockers, and articles in safe custody for deceased bank customers, aiming to minimize delays and ensure uniform practices across commercial and cooperative banks. They do not apply to government-administered savings schemes like PPF or SCSS.</p>\n\n<p>The legal basis for these directions rests on provisions intended to expedite claim settlements. The RBI observed inconsistent bank practices regarding nomination, often requiring succession certificates even with existing nominations. These directions repeal prior circulars, establishing a uniform and enforceable system.</p>\n\n<p>For claims exceeding a specified threshold, settlement necessitates succession certificates, legal heir certificates, or affidavits, potentially with sureties. Banks retain discretion to act on uncontested Wills without requiring probate but require court orders for disputed claims. In the absence of a nomination, a simplified procedure involves claim forms, death certificates, identity proof, and a legal heir certificate or affidavit with no-objection statements from other heirs. Disputed cases without nomination require probate, succession certificate, or a court order for resolution.</p>\n\n<p>These Directions represent a significant reform in banking consumer protection law, establishing uniform procedures, timelines, and penalties for delays. They address long-standing grievances by depositor families, ensuring efficient access to funds and belongings while balancing ease of settlement with safeguards against wrongful claims. The harmonized framework enhances operational clarity for banks and strengthens customer trust in the banking system.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbi-issues-directions-on-settlement-of-deceased-claims.jpg"
  },
  {
    "title": "Supreme Court Restores CCI Penalties on Film Exhibitors’ Federation for Anti-Competitive Conduct",
    "description": "<p>The Supreme Court has allowed the Competition Commission of India's (CCI) appeal, reinstating its order against the Kerala Film Exhibitors Federation (KFEF) for anti-competitive conduct under Section 3 of the Competition Act. The court ruled that the CCI's initial notice, forwarding the Director General's (DG) report and inviting replies and a hearing, adequately complied with the Act. It held that a separate show-cause notice dedicated solely to the penalty was not required under the statutory scheme.</p>\n\n<p>The case stemmed from a complaint alleging KFEF organized a boycott preventing distributors from dealing with a specific theater. The CCI, based on the DG's report, found KFEF in violation and imposed monetary penalties and behavioral directions on the federation and its office-bearers. The COMPAT (Competition Appellate Tribunal) upheld the violation finding but overturned penalties against the office-bearers, arguing the lack of a separate penalty notice.</p>\n\n<p>The Supreme Court addressed whether a second, separate show-cause notice specifically proposing penalties is required before imposing sanctions under the Act. The Court emphasized that the Competition Act necessitates timely and effective adjudication, with a single hearing offering a full opportunity to address both findings and potential sanctions. The Court found that the initial notice sufficiently identified the contraventions, named the individuals involved, sought financial information, and scheduled a hearing, satisfying the requirements of natural justice. Furthermore, the Court highlighted that Section 48 of the Act deems individuals in charge responsible for contraventions, negating the need for separate notification of liability. The Supreme Court restored the CCI's original order in full, also noting the importance of the DG report stage and the need to address all factual and mitigation points at that hearing.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-restores-cci-penalties-on-kerala-film-exhibitors.jpg"
  }
]