[
  {
    "title": "Supreme Court Restores CCI Penalties on Film Exhibitors’ Federation for Anti-Competitive Conduct",
    "description": "<p>The Supreme Court has allowed the Competition Commission of India's (CCI) appeal, reinstating its order against the Kerala Film Exhibitors Federation (KFEF) for anti-competitive conduct under Section 3 of the Competition Act. The court ruled that the CCI's initial notice, forwarding the Director General's (DG) report and inviting replies and a hearing, adequately complied with the Act. It held that a separate show-cause notice dedicated solely to the penalty was not required under the statutory scheme.</p>\n\n<p>The case stemmed from a complaint alleging KFEF organized a boycott preventing distributors from dealing with a specific theater. The CCI, based on the DG's report, found KFEF in violation and imposed monetary penalties and behavioral directions on the federation and its office-bearers. The COMPAT (Competition Appellate Tribunal) upheld the violation finding but overturned penalties against the office-bearers, arguing the lack of a separate penalty notice.</p>\n\n<p>The Supreme Court addressed whether a second, separate show-cause notice specifically proposing penalties is required before imposing sanctions under the Act. The Court emphasized that the Competition Act necessitates timely and effective adjudication, with a single hearing offering a full opportunity to address both findings and potential sanctions. The Court found that the initial notice sufficiently identified the contraventions, named the individuals involved, sought financial information, and scheduled a hearing, satisfying the requirements of natural justice. Furthermore, the Court highlighted that Section 48 of the Act deems individuals in charge responsible for contraventions, negating the need for separate notification of liability. The Supreme Court restored the CCI's original order in full, also noting the importance of the DG report stage and the need to address all factual and mitigation points at that hearing.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-restores-cci-penalties-on-kerala-film-exhibitors.jpg"
  }
]