[
  {
    "title": "SEBI (Custodian) (Amendment) Regulations, 2025: Raising Standards for Custodians of Securities",
    "description": "<p>The Securities and Exchange Board of India (SEBI) notified the Securities and Exchange Board of India (Custodian) (Amendment) Regulations, 2025 (“Amendment Regulations”) on September 18, 2025. These amendments significantly revise the SEBI (Custodian of Securities) Regulations, 1996 (“Principal Regulations”), enhancing financial thresholds, governance obligations, and compliance responsibilities for custodians to reinforce systemic stability, strengthen investor protection, and align with international standards.</p>\n\n<p>The amendments raise the minimum net worth requirement from ₹50 crore to ₹75 crore, with a three-year transition period for existing custodians. Custodians must maintain this net worth independently of other capital adequacy requirements. The scope of permissible activities is broadened, excluding banking companies and their affiliates. A new regulation mandates robust risk management frameworks, cybersecurity protocols, and business continuity plans.</p>\n\n<p>The code of conduct has been expanded to include 26 obligations. Custodians must comply with SEBI, RBI, and depository rules, avoid unfair competition, and provide effective grievance redressal mechanisms. They must also implement strong internal controls against fraud and misconduct, ensure the fitness of directors and key personnel, and empower independent compliance officers.</p>\n\n<p>These amendments increase compliance and capitalisation costs for custodians but also create opportunities for diversification. Investors benefit from enhanced transparency, strengthened grievance mechanisms, and reduced systemic risks. SEBI gains a more effective oversight framework, harmonising domestic norms with global standards, and enhancing investor confidence in Indian capital markets. These amendments represent a substantive reform of India’s custodian regime, strengthening the resilience and accountability of market infrastructure while safeguarding investor interests.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sebi-tightens-custodian-rules-with-2025-amendments.jpg"
  },
  {
    "title": "RBI Digitizes Voluntary Surrender of NBFC/HFC Licenses",
    "description": "<p>The Reserve Bank of India (RBI) has announced that Non-Banking Financial Companies (NBFCs) and Housing Finance Companies (HFCs) must now use the PRAVAAH portal to apply for the cancellation of their Certificate of Registration (COR). This update, announced on September 23, 2025, moves the process from email and hard-copy submissions to a centralized online platform.</p>\n\n<p>PRAVAAH, launched in May 2024, serves as a single-window system for various RBI approvals. The surrender-of-license module has been integrated into the portal, allowing applicants to upload the required PDF application form and supporting documents. The portal provides automated acknowledgment and routes the application to the relevant regional supervisory office.</p>\n\n<p>Despite the digitization of the application process, the RBI emphasizes that submitting the application does not immediately terminate the license. NBFCs and HFCs remain subject to all applicable regulations and reporting requirements until the RBI formally issues a cancellation letter, a process that may take several months. These institutions must continue to adhere to all guidelines issued by the RBI, NHB, or other relevant authorities and submit all required regulatory and supervisory returns during this interim period.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbi-digitalises-nbfc-hfc-licence-surrender-via-pravaah.jpg"
  },
  {
    "title": "Supreme Court Guidelines on Expeditious Disposal & Compounding under Section 138 NI Act: Sanjabij Tari v. Kishore S. Borcar",
    "description": "<p>On September 25, 2025, the Supreme Court of India issued a notable judgment in Sanjabij Tari v. Kishore S. Borcar (2025 INSC 1158), providing critical clarifications regarding cheque dishonour prosecutions under Section 138 of the Negotiable Instruments Act, 1881 (NI Act). The decision addresses both substantive legal issues, such as the presumption of liability and the enforceability of cash loans, and prescribes systemic reforms intended to alleviate the significant backlog of cheque bounce litigation in trial courts.</p>\n\n<p>The judgment clarifies recurring issues related to Section 138 of the NI Act, which criminalizes the dishonour of cheques issued for debt or liability discharge. It reinforces that once cheque execution is admitted, Sections 118(a) and 139 of the NI Act establish presumptions favoring the complainant, indicating the cheque was issued against a legally enforceable debt.</p>\n\n<p>Recognizing the extensive backlog of Section 138 cases, the Court implemented practical reforms aimed at expediting disposal and reducing pendency. These reforms include guidelines to limit revisional interference and promote compounding of offences.</p>\n\n<p>The Supreme Court's ruling in Sanjabij Tari v. Kishore S. Borcar is a significant development in cheque dishonour jurisprudence. It provides clarity on substantive law related to presumptions and debt enforceability while also introducing procedural reforms to address case backlogs. This combination of doctrinal clarity and systemic innovation is a crucial step toward improving the efficiency and credibility of cheque bounce litigation within the Indian judicial system.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-issues-guidelines-on-cheque-bounce-cash-loan-cases.jpg"
  },
  {
    "title": "Public Land Auction Set Aside by Supreme Court Due to Statutory Non-Compliance",
    "description": "<p>In Delhi Development Authority v. Corporation Bank & Ors., the Supreme Court of India invalidated the Debts Recovery Tribunal (DRT)'s auction of Delhi Development Authority (DDA) land. The Court held that the sale violated statutory safeguards and breached lease conditions, emphasizing that public land requires strict legal adherence for mortgage or transfer, making non-compliant auctions invalid.</p>\n\n<p>The ruling balanced protecting public property and ensuring fairness by protecting the bona fide auction purchaser through restitution with interest. This underscored the accountability of banks and state authorities while safeguarding innocent third parties in property and recovery proceedings.</p>\n\n<p>The case originated from a DDA plot allotted to Sarita Vihar Club in 2001 for a sports facility, subject to conditions, including that it could not be mortgaged without the Lieutenant Governor of Delhi's written consent. The club mortgaged the property to Corporation Bank without this consent, leading to recovery proceedings by the bank when the club defaulted. The DDA objected to the subsequent auction by the DRT due to non-compliance with the lease conditions and statutory requirements.</p>\n\n<p>The Supreme Court's decision has significant implications for property law and banking, reinforcing that statutory safeguards for leasehold land are non-negotiable and banks must conduct due diligence when providing loans. The ruling also clarifies that res judicata does not shield repeated violations. This is poised to influence banking prudence and recovery proceedings, ensuring the statutory rights of public authorities are upheld.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-quashes-drt-auction-of-dda-land-for-non-compliance.jpg"
  },
  {
    "title": "Supreme Court Clarifies Key Insolvency Issues In Bhushan Power & Steel",
    "description": "<p>The Supreme Court's ruling in Kalyani Transco v. Bhushan Power & Steel Ltd. & Ors. addresses several critical issues arising from the Corporate Insolvency Resolution Process (CIRP) of Bhushan Power and Steel Limited (BPSL) under the Insolvency and Bankruptcy Code, 2016 (IBC). The case stemmed from challenges to the resolution plan submitted by JSW Steel, the Successful Resolution Applicant (SRA), and approved by the Committee of Creditors (CoC) and the National Company Law Tribunal (NCLT).</p>\n\n<p>The Supreme Court's judgment reinforces the sanctity of resolution plans and the importance of creditor decision-making within the IBC framework. The court addressed issues such as the locus standi of promoters, the continuation of the CoC after plan approval, the permissibility of extending plan implementation timelines, and the treatment of profits (EBITDA) earned by the corporate debtor during CIRP. It also clarified the extinguishment of pre-CIRP claims upon resolution plan approval.</p>\n\n<p>Key rulings include the acceptance of promoters as \"persons aggrieved\" with caveats regarding obstructive behavior, the clarification that the CoC remains active until plan implementation or liquidation, and the rejection of clauses allowing indefinite extension of implementation. The court also ruled that EBITDA earned during CIRP remains with the corporate debtor unless the resolution plan specifies otherwise, and reaffirmed that pre-CIRP claims are extinguished upon plan approval under Section 31 of the IBC. The judgment underscores the paramount importance of the commercial wisdom of the CoC and protects resolution applicants from penalties for delays caused by external factors.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/supreme-court-ruling-in-bhushan-power-insolvency-case.jpg"
  },
  {
    "title": "Lok Adalat vs. Employees’ Compensation Act: Kerala High Court Upholds Settlement Finality",
    "description": "<p>The Kerala High Court, in a judgment delivered on September 22, 2025, addressed the issue of whether a settlement reached at a Lok Adalat precludes a subsequent claim for compensation under the Employees’ Compensation Act, 1923, and whether Section 8(1) of the Act prohibits payments not deposited with the Commissioner. The case involved parents who, after their son's death in a workplace accident, received Rs 10 lakh through a Lok Adalat settlement and later sought additional compensation from the Employees’ Compensation Commissioner.</p>\n\n<p>The Commissioner denied the claim, citing the prior Lok Adalat award as a final discharge of liability. The parents appealed this decision, leading the High Court to formulate two substantial questions of law: whether the Employees’ Compensation Act claim can be settled through a Pre-Litigation Petition despite Section 8(1) of the EC Act, and whether receipt of money from the Lok Adalat bars a subsequent claim for the statutory amount before the Commissioner.</p>\n\n<p>The Court, referencing the supremacy clause in Section 25 of the Legal Services Authorities Act, ruled that the Lok Adalat settlement was final. It reasoned that when a dispute is taken to a Permanent Lok Adalat, the restrictions of Section 8(1) are relaxed, given the Adalat's role in protecting weaker parties. The court also invoked the doctrine of election of remedies, stating that the parents, having chosen to settle at the Lok Adalat, were bound by that choice. Thus, the appeal was dismissed, affirming that the Rs 10 lakh already received constituted a full and conclusive settlement, preventing the family from pursuing further compensation through the Employees’ Compensation Commissioner.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/kerala-hc-lok-adalat-settlements-are-final-in-ec-claims.jpg"
  },
  {
    "title": "Judicial Rationale in Sharad Singh v. H. D. Narang: A Significant Refinement in Compensation for a Paraplegic Victim",
    "description": "<p>In Sharad Singh v. H. D. Narang, the Supreme Court of India delivered a landmark judgment enhancing the compensation awarded to the legal representative of a deceased accident victim, Sharad Singh, who suffered paraplegia due to a motor vehicle accident. The ruling, authored by Justice K. Vinod Chandran and Justice N.V. Anjaria, refines motor accident compensation jurisprudence, particularly concerning students with demonstrated academic potential.</p>\n\n<p>The victim, a 20-year-old B. Com student and ICAI enrollee, sustained severe injuries in 2001 when a negligently driven car struck the motorcycle he was riding, resulting in complete paraplegia. He remained bedridden until his death in 2021. The Supreme Court addressed the High Court's inadequate assessment of income and future medical expenses. It dismissed the insurance company's objections to medical bills from hospitals outside the victim's hometown, emphasizing the company's national presence and the legitimate need for specialized care in different locations.  The Court upheld medical expenses amounting to Rs. 20 lakhs, recognizing the necessity of the treatments for sustaining the victim's life.</p>\n\n<p>Critically, the Court rejected the lower courts' reliance on minimum wage as the basis for calculating loss of income. The Supreme Court deemed the use of minimum wage inappropriate for a graduate student pursuing a Chartered Accountancy qualification. Instead, it estimated a notional monthly income of Rs. 5,000 in 2001, considering his potential as an accountant, and applied a 40% increase for future prospects, consistent with National Insurance Company Limited vs. Pranay Sethi and Others. This led to a revised loss of income calculation of Rs. 15,12,000.</p>\n\n<p>The Supreme Court's judgment resulted in a significantly enhanced total compensation award of Rs. 40,34,356. The Court underscored the importance of considering a student's potential when determining compensation and reiterated that insurance companies cannot evade liability on unsubstantiated grounds, especially when life-saving medical care is involved. The ruling serves as a precedent for equitable compensation, acknowledging both the victim's potential and the substantial costs associated with life-sustaining care.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-enhances-compensation-in-sharad-singh-paraplegia-case.jpg"
  },
  {
    "title": "Reshaping Professional Services: MCA Issues Consultation on Multi-Disciplinary Partnerships",
    "description": "<p>The Ministry of Corporate Affairs (MCA) launched a public consultation on September 17, 2025, regarding the proposed establishment of Multi-Disciplinary Partnership (MDP) firms in India. This initiative seeks to create a regulatory framework that enables domestic professional services firms (e.g., law, accounting, consulting) to compete effectively with larger international networks by allowing collaboration across disciplines while maintaining professional independence. Stakeholders are invited to submit their feedback by September 30, 2025, via the MCA’s e-Consultation Module or email.</p>\n\n<p>Currently, Indian professional services firms operate within a fragmented regulatory environment, constrained by multiple professional statutes and licensing requirements that restrict cross-disciplinary collaboration. Recognizing that these structural challenges impede growth and competitiveness, the MCA is exploring MDPs as a solution, drawing on global best practices.</p>\n\n<p>The consultation, initiated through Notification No. 01/5/2025-PI/MCA, invites stakeholder views on various aspects of MDPs, including governance models, accountability, and transitional arrangements. This consultation presents an opportunity to shape the future of the professional services sector in India. If implemented effectively, MDPs could enhance efficiency, foster competition, and elevate Indian firms on the global stage. Stakeholder feedback is crucial in shaping a robust and forward-looking framework for multidisciplinary firms in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/mca-seeks-views-on-multi-disciplinary-partnership-firms.jpg"
  },
  {
    "title": "PVR Wins Consumer Case: Restriction on Outside Snacks Upheld, Free Water Mandated",
    "description": "<p>The District Consumer Disputes Redressal Commission, Ernakulam, dismissed a consumer complaint against PVR Cinemas regarding its policy of prohibiting outside food and beverages. The complainant argued that this restriction constituted an unfair trade practice, forcing consumers to purchase overpriced in-house items.</p>\n\n<p>The Commission ruled that cinema theaters have the legal right to regulate entry conditions, including restricting outside food, referencing the Supreme Court precedent set in K.C. Cinema v. State of J&K. This right is contingent upon ensuring free access to drinking water and accommodating special needs. The complainant failed to prove a deficiency in service, as the ban on outside food was consistent with established legal precedent.</p>\n\n<p>While dismissing the complaint, the Commission issued a binding directive, ordering PVR Cinemas to strictly comply with its undertaking to provide uninterrupted access to free RO-filtered drinking water for all customers. This includes maintaining the facility hygienically and displaying prominent signage. This decision balances the operational rights of the multiplex with the fundamental health and welfare of consumers, mitigating potential exploitative practices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/pvr-wins-case-outside-food-ban-upheld-free-water-mandated.jpg"
  },
  {
    "title": "RBI Issues Directions on Settlement of Claims for Deceased Customers",
    "description": "<p>The Reserve Bank of India (RBI) released the Reserve Bank of India (Settlement of Claims in respect of Deceased Customers of Banks) Directions, 2025, effective March 31, 2026. These directions consolidate and standardize procedures for settling claims related to deposit accounts, safe deposit lockers, and articles in safe custody for deceased bank customers, aiming to minimize delays and ensure uniform practices across commercial and cooperative banks. They do not apply to government-administered savings schemes like PPF or SCSS.</p>\n\n<p>The legal basis for these directions rests on provisions intended to expedite claim settlements. The RBI observed inconsistent bank practices regarding nomination, often requiring succession certificates even with existing nominations. These directions repeal prior circulars, establishing a uniform and enforceable system.</p>\n\n<p>For claims exceeding a specified threshold, settlement necessitates succession certificates, legal heir certificates, or affidavits, potentially with sureties. Banks retain discretion to act on uncontested Wills without requiring probate but require court orders for disputed claims. In the absence of a nomination, a simplified procedure involves claim forms, death certificates, identity proof, and a legal heir certificate or affidavit with no-objection statements from other heirs. Disputed cases without nomination require probate, succession certificate, or a court order for resolution.</p>\n\n<p>These Directions represent a significant reform in banking consumer protection law, establishing uniform procedures, timelines, and penalties for delays. They address long-standing grievances by depositor families, ensuring efficient access to funds and belongings while balancing ease of settlement with safeguards against wrongful claims. The harmonized framework enhances operational clarity for banks and strengthens customer trust in the banking system.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/rbi-issues-directions-on-settlement-of-deceased-claims.jpg"
  },
  {
    "title": "Supreme Court Restores CCI Penalties on Film Exhibitors’ Federation for Anti-Competitive Conduct",
    "description": "<p>The Supreme Court has allowed the Competition Commission of India's (CCI) appeal, reinstating its order against the Kerala Film Exhibitors Federation (KFEF) for anti-competitive conduct under Section 3 of the Competition Act. The court ruled that the CCI's initial notice, forwarding the Director General's (DG) report and inviting replies and a hearing, adequately complied with the Act. It held that a separate show-cause notice dedicated solely to the penalty was not required under the statutory scheme.</p>\n\n<p>The case stemmed from a complaint alleging KFEF organized a boycott preventing distributors from dealing with a specific theater. The CCI, based on the DG's report, found KFEF in violation and imposed monetary penalties and behavioral directions on the federation and its office-bearers. The COMPAT (Competition Appellate Tribunal) upheld the violation finding but overturned penalties against the office-bearers, arguing the lack of a separate penalty notice.</p>\n\n<p>The Supreme Court addressed whether a second, separate show-cause notice specifically proposing penalties is required before imposing sanctions under the Act. The Court emphasized that the Competition Act necessitates timely and effective adjudication, with a single hearing offering a full opportunity to address both findings and potential sanctions. The Court found that the initial notice sufficiently identified the contraventions, named the individuals involved, sought financial information, and scheduled a hearing, satisfying the requirements of natural justice. Furthermore, the Court highlighted that Section 48 of the Act deems individuals in charge responsible for contraventions, negating the need for separate notification of liability. The Supreme Court restored the CCI's original order in full, also noting the importance of the DG report stage and the need to address all factual and mitigation points at that hearing.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/sc-restores-cci-penalties-on-kerala-film-exhibitors.jpg"
  }
]